{
  "Version": "V7.3",
  "LastScriptUpdate": "Last Update: 24/02/2026",
  "LatestScriptUpdateDate": "2026-02-19T00:05:51Z",
  "ChangeLog": "\n<b>V7.3 Changelog</b>\n\n-> Added Distance slider and Targeting Mode dropdown to Moves Aimbot with \"Angle & Distance\" and \"Distance\" options, improving enemy prioritization while fighting.\n-> Added Targeting Mode dropdown and Distance slider to TP Behind Moves.\n-> Lock On is now a toggle; body part selection updates instantly without resetting the lock, along with additional improvements.\n-> Added Smooth Lock toggle in the Lock On section.\n-> Replaced the old Quests ESP toggle with an NPCs ESP dropdown featuring \"Pending Quests\", \"No Quest\", and \"All\".\n-> Added Cell Jr, Android 19, and Android 20 quests to Auto Quest.\n-> Added a Media section to the Misc page.\n-> Added Acrylic Blur in UI Settings to improve text readability and modernize the interface.\n-> Added new UI themes: Amberfall, Neon Tide, Verdant Glass, Midnight Prism, Frozen Aurora, and Opaline Halo.\n-> Added a secondary fallback source to improve script loading reliability if the primary request fails.\n-> Themes now load significantly faster.\n-> Several buttons are now bindable (Earth TP, Namek TP, Lobby TP, Fling, UnHook, Invite Everyone, Load Configuration, Load Race Configuration), along with additional toggles.\n-> Auto Quest now automatically drinks Korin Water.\n-> Slightly increased nearby enemy detection radius at boss doors in Auto Dungeon.\n-> Adjusted minimum and default values in Hide Distance; Hide From Players now travels slightly faster initially.\n-> Spy Chat is now disabled by default to reduce accidental exposure.\n-> Improved HTTP error notifications for clearer load failure diagnostics.\n-> Various internal UI improvements and notification system cleanup.\n-> Patched an important on-execution detection related to the UI library (never detected).\n-> Patched a potential Lock On detection (never detected).\n-> Fixed an issue where loading configurations removed feature descriptions.\n-> Fixed Auto Quest selecting the wrong option for the EcosystemGiver quest on first completion.\n-> Fixed an error when the UI Library failed to load.\n-> Fixed an issue in the Players Health Bar feature.\n-> Other minor fixes and stability improvements (e.g., UnHook disabling UI customization toggles)."
}



