{
  "Version": "V7.5",
  "LastScriptUpdate": "24/02/2026",
  "LatestScriptUpdateDate": "2026-02-19T00:05:51Z",
  "ChangeLog": "-> Added Distance slider and Targeting Mode dropdown to Moves Aimbot feature with \"Angle & Distance\" and \"Distance\" options, so your aim goes towards the enemy you are fighting and not someone who was near you.\n-> Added Targeting Mode dropdown and Distance slider to TP Behind Moves feature too.\n-> Lock On is now a toggle and changing body parts dropdown gets updated immediately without having to reset the lock, along with more improvements.\n-> Added Smooth Lock toggle in Lock On section.\n-> Added NPCs ESP dropdown with \"Pending Quests\", \"No Quest\", \"All\" options. Replaces the old Quests ESP toggle.\n-> Added Cell Jr and Android 19 & Android 20 quests to Auto Quest.\n-> Added Media section in Misc page.\n-> Added Acrylic Blur in UI Settings, improves text readability and gives the UI a more modern look.\n-> Added Amberfall, Neon Tide, Verdant Glass, Midnight Prism, Frozen Aurora and Opaline Halo UI Themes.\n-> Themes now load significantly faster.\n-> Some buttons are now bindable (Earth TP, Namek TP, Lobby TP, Fling, UnHook, Invite Everyone, Load Configuration, Load Race Configuration) and some other toggles too.\n-> Auto Quest now automatically drinks korin water.\n-> Increased nearby enemy detection radius slightly at boss doors in Auto Dungeon.\n-> Slightly higher minimum and default values in Hide Distance slider and Hide From Players feature now initially travels slightly faster.\n-> Spy Chat is now disabled by default, you can easily get caught using it like in a screenshot and you couldn't notice that you shouldn't be able to see the chat in that world.\n-> Many Internal UI improvements and cleaned up some notifications code.\n-> Patched an important on-execution detection from the UI library (it was never detected).\n-> Patched a potential detection on Lock On (it was never detected).\n-> Fixed loading configurations removing descriptions from all the features.\n-> Fixed Auto Quest choosing the wrong option for the EcosystemGiver quest if you were doing it for the first time.\n-> Fixed the check for when the UI Library couldn't be loaded, it would error before.\n-> Fixed an error in Players Health Bar feature.\n-> Other minor fixes like UnHook disabling UI customization toggles, etc."

}







